Using TensorFlow backend.
(32, 32, 3)
(40000, 32, 32, 3) (40000, 1) (10000, 32, 32, 3) (10000, 1)
Training features shape:  (40000, 32, 32, 3)
Validation features shape:  (10000, 32, 32, 3)
Test features shape:  (10000, 32, 32, 3)
hi (32, 32, 3)
(?, 32, 32, 3)
2018-10-03 22:14:30.236198: I tensorflow/core/platform/cpu_feature_guard.cc:141] Your CPU supports instructions that this TensorFlow binary was not compiled to use: AVX2 FMA
2018-10-03 22:14:30.304668: I tensorflow/stream_executor/cuda/cuda_gpu_executor.cc:964] successful NUMA node read from SysFS had negative value (-1), but there must be at least one NUMA node, so returning NUMA node zero
2018-10-03 22:14:30.305059: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1411] Found device 0 with properties: 
name: GeForce GTX 980 major: 5 minor: 2 memoryClockRate(GHz): 1.2785
pciBusID: 0000:01:00.0
totalMemory: 3.94GiB freeMemory: 3.06GiB
2018-10-03 22:14:30.356762: I tensorflow/stream_executor/cuda/cuda_gpu_executor.cc:964] successful NUMA node read from SysFS had negative value (-1), but there must be at least one NUMA node, so returning NUMA node zero
2018-10-03 22:14:30.357150: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1411] Found device 1 with properties: 
name: GeForce GTX 970 major: 5 minor: 2 memoryClockRate(GHz): 1.329
pciBusID: 0000:02:00.0
totalMemory: 3.94GiB freeMemory: 3.87GiB
2018-10-03 22:14:30.357310: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1490] Adding visible gpu devices: 0, 1
2018-10-03 22:14:30.715146: I tensorflow/core/common_runtime/gpu/gpu_device.cc:971] Device interconnect StreamExecutor with strength 1 edge matrix:
2018-10-03 22:14:30.715176: I tensorflow/core/common_runtime/gpu/gpu_device.cc:977]      0 1 
2018-10-03 22:14:30.715181: I tensorflow/core/common_runtime/gpu/gpu_device.cc:990] 0:   N Y 
2018-10-03 22:14:30.715184: I tensorflow/core/common_runtime/gpu/gpu_device.cc:990] 1:   Y N 
2018-10-03 22:14:30.715404: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1103] Created TensorFlow device (/job:localhost/replica:0/task:0/device:GPU:0 with 2770 MB memory) -> physical GPU (device: 0, name: GeForce GTX 980, pci bus id: 0000:01:00.0, compute capability: 5.2)
2018-10-03 22:14:30.737961: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1103] Created TensorFlow device (/job:localhost/replica:0/task:0/device:GPU:1 with 3599 MB memory) -> physical GPU (device: 1, name: GeForce GTX 970, pci bus id: 0000:02:00.0, compute capability: 5.2)
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 32, 32, 3)    0                                            
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 16)   448         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 32, 32, 16)   64          conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 32, 32, 16)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 32, 16)   2320        activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 32, 16)   64          conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 32, 16)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 16)   2320        activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 32, 32, 16)   64          conv2d_4[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 32, 16)   0           conv2d_2[0][0]                   
                                                                 batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 32, 32, 16)   0           add_1[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 16, 16, 16)   0           activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 16, 16, 64)   9280        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 16, 16, 64)   256         conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 16, 16, 64)   0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 16, 16, 64)   36928       activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 16, 16, 64)   256         conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 16, 16, 64)   0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 16, 16, 64)   36928       activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 16, 16, 64)   256         conv2d_8[0][0]                   
__________________________________________________________________________________________________
add_2 (Add)                     (None, 16, 16, 64)   0           conv2d_6[0][0]                   
                                                                 batch_normalization_6[0][0]      
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 16, 16, 64)   0           add_2[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 8, 8, 64)     0           activation_6[0][0]               
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 8, 8, 128)    73856       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 8, 8, 128)    512         conv2d_10[0][0]                  
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 8, 8, 128)    0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 8, 8, 128)    147584      activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 8, 8, 128)    512         conv2d_11[0][0]                  
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 8, 8, 128)    0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 8, 8, 128)    147584      activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 8, 8, 128)    512         conv2d_12[0][0]                  
__________________________________________________________________________________________________
add_3 (Add)                     (None, 8, 8, 128)    0           conv2d_10[0][0]                  
                                                                 batch_normalization_9[0][0]      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 8, 8, 128)    0           add_3[0][0]                      
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 1, 1, 128)    0           activation_9[0][0]               
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 128)          0           average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           1290        flatten_1[0][0]                  
==================================================================================================
Total params: 461,034
Trainable params: 459,786
Non-trainable params: 1,248
__________________________________________________________________________________________________
Learning rate:  0.001
Epoch 1/128
1250/1250 [==============================] - 19s 15ms/step - loss: 1.4729 - acc: 0.4899 - val_loss: 1.6433 - val_acc: 0.4994
Epoch 2/128
1250/1250 [==============================] - 17s 14ms/step - loss: 1.1429 - acc: 0.6179 - val_loss: 1.3391 - val_acc: 0.5756
Epoch 3/128
1250/1250 [==============================] - 17s 14ms/step - loss: 1.0211 - acc: 0.6681 - val_loss: 1.0759 - val_acc: 0.6685
Epoch 4/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.9316 - acc: 0.7033 - val_loss: 0.9135 - val_acc: 0.7172
Epoch 5/128
1250/1250 [==============================] - 18s 14ms/step - loss: 0.8723 - acc: 0.7295 - val_loss: 0.8196 - val_acc: 0.7547
Epoch 6/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.8300 - acc: 0.7465 - val_loss: 0.8656 - val_acc: 0.7398
Epoch 7/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.7877 - acc: 0.7651 - val_loss: 0.7927 - val_acc: 0.7674
Epoch 8/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.7619 - acc: 0.7765 - val_loss: 0.8066 - val_acc: 0.7703
Epoch 9/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.7317 - acc: 0.7886 - val_loss: 0.8038 - val_acc: 0.7678
Epoch 10/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.7159 - acc: 0.7956 - val_loss: 0.7535 - val_acc: 0.7848
Epoch 11/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.6961 - acc: 0.8035 - val_loss: 0.6915 - val_acc: 0.8045
Epoch 12/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.6792 - acc: 0.8129 - val_loss: 0.7630 - val_acc: 0.7836
Epoch 13/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.6667 - acc: 0.8156 - val_loss: 0.7350 - val_acc: 0.8008
Epoch 14/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.6454 - acc: 0.8237 - val_loss: 0.7782 - val_acc: 0.7872
Epoch 15/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.6391 - acc: 0.8255 - val_loss: 0.6529 - val_acc: 0.8231
Epoch 16/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.6245 - acc: 0.8310 - val_loss: 0.6893 - val_acc: 0.8064
Epoch 17/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.6162 - acc: 0.8368 - val_loss: 0.6841 - val_acc: 0.8169
Epoch 18/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.6050 - acc: 0.8409 - val_loss: 0.7330 - val_acc: 0.8038
Epoch 19/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.5915 - acc: 0.8459 - val_loss: 0.7414 - val_acc: 0.8031
Epoch 20/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.5862 - acc: 0.8486 - val_loss: 0.6648 - val_acc: 0.8255
Epoch 21/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.5790 - acc: 0.8507 - val_loss: 0.7754 - val_acc: 0.7984
Epoch 22/128
1250/1250 [==============================] - 18s 14ms/step - loss: 0.5747 - acc: 0.8518 - val_loss: 0.7410 - val_acc: 0.8048
Epoch 23/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.5686 - acc: 0.8554 - val_loss: 0.6724 - val_acc: 0.8237
Epoch 24/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.5608 - acc: 0.8580 - val_loss: 0.6350 - val_acc: 0.8350
Epoch 25/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.5549 - acc: 0.8599 - val_loss: 0.7373 - val_acc: 0.8000
Epoch 26/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.5482 - acc: 0.8642 - val_loss: 0.6766 - val_acc: 0.8255
Epoch 27/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.5450 - acc: 0.8635 - val_loss: 0.8214 - val_acc: 0.7947
Epoch 28/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.5335 - acc: 0.8685 - val_loss: 0.8612 - val_acc: 0.7847
Epoch 29/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.5346 - acc: 0.8673 - val_loss: 0.6577 - val_acc: 0.8312
Epoch 30/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.5273 - acc: 0.8693 - val_loss: 0.7318 - val_acc: 0.8175
Epoch 31/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.5218 - acc: 0.8724 - val_loss: 0.6855 - val_acc: 0.8233
Epoch 32/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.5209 - acc: 0.8738 - val_loss: 0.6385 - val_acc: 0.8395
Epoch 33/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.5119 - acc: 0.8779 - val_loss: 0.6271 - val_acc: 0.8449
Epoch 34/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.5151 - acc: 0.8767 - val_loss: 0.7150 - val_acc: 0.8202
Epoch 35/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.5121 - acc: 0.8776 - val_loss: 0.5929 - val_acc: 0.8582
Epoch 36/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.5048 - acc: 0.8806 - val_loss: 0.6186 - val_acc: 0.8436
Epoch 37/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.5008 - acc: 0.8803 - val_loss: 0.6056 - val_acc: 0.8495
Epoch 38/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4999 - acc: 0.8822 - val_loss: 0.8128 - val_acc: 0.8009
Epoch 39/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4932 - acc: 0.8823 - val_loss: 0.7475 - val_acc: 0.8242
Epoch 40/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4924 - acc: 0.8850 - val_loss: 0.7544 - val_acc: 0.8219
Epoch 41/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4943 - acc: 0.8852 - val_loss: 0.6338 - val_acc: 0.8424
Epoch 42/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4860 - acc: 0.8871 - val_loss: 0.6769 - val_acc: 0.8395
Epoch 43/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4842 - acc: 0.8893 - val_loss: 0.6563 - val_acc: 0.8447
Epoch 44/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4831 - acc: 0.8904 - val_loss: 0.6248 - val_acc: 0.8482
Epoch 45/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4861 - acc: 0.8893 - val_loss: 0.7593 - val_acc: 0.8224
Epoch 46/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4837 - acc: 0.8900 - val_loss: 0.6554 - val_acc: 0.8436
Epoch 47/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4694 - acc: 0.8953 - val_loss: 0.6018 - val_acc: 0.8562
Epoch 48/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4732 - acc: 0.8941 - val_loss: 0.6859 - val_acc: 0.8404
Epoch 49/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4749 - acc: 0.8926 - val_loss: 0.6361 - val_acc: 0.8480
Epoch 50/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4758 - acc: 0.8933 - val_loss: 0.6273 - val_acc: 0.8450
Epoch 51/128
1250/1250 [==============================] - 18s 14ms/step - loss: 0.4694 - acc: 0.8946 - val_loss: 0.6493 - val_acc: 0.8444
Epoch 52/128
1250/1250 [==============================] - 18s 14ms/step - loss: 0.4682 - acc: 0.8952 - val_loss: 0.6161 - val_acc: 0.8570
Epoch 53/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4688 - acc: 0.8962 - val_loss: 0.6477 - val_acc: 0.8472
Epoch 54/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4628 - acc: 0.8975 - val_loss: 0.7217 - val_acc: 0.8364
Epoch 55/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4600 - acc: 0.8966 - val_loss: 0.6681 - val_acc: 0.8435
Epoch 56/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4611 - acc: 0.8986 - val_loss: 0.6460 - val_acc: 0.8398
Epoch 57/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4594 - acc: 0.8991 - val_loss: 0.6074 - val_acc: 0.8567
Epoch 58/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4555 - acc: 0.9008 - val_loss: 0.6516 - val_acc: 0.8466
Epoch 59/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4573 - acc: 0.8989 - val_loss: 0.6604 - val_acc: 0.8469
Epoch 60/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4549 - acc: 0.9008 - val_loss: 0.7310 - val_acc: 0.8341
Epoch 61/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4531 - acc: 0.9011 - val_loss: 0.6937 - val_acc: 0.8336
Epoch 62/128
1250/1250 [==============================] - 18s 14ms/step - loss: 0.4517 - acc: 0.9019 - val_loss: 0.5782 - val_acc: 0.8616
Epoch 63/128
1250/1250 [==============================] - 18s 14ms/step - loss: 0.4519 - acc: 0.9022 - val_loss: 0.5923 - val_acc: 0.8646
Epoch 64/128
1250/1250 [==============================] - 18s 14ms/step - loss: 0.4489 - acc: 0.9035 - val_loss: 0.6933 - val_acc: 0.8409
Epoch 65/128
1250/1250 [==============================] - 18s 15ms/step - loss: 0.4469 - acc: 0.9029 - val_loss: 0.6127 - val_acc: 0.8611
Epoch 66/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4428 - acc: 0.9056 - val_loss: 0.6587 - val_acc: 0.8455
Epoch 67/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4437 - acc: 0.9040 - val_loss: 0.5914 - val_acc: 0.8633
Epoch 68/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4439 - acc: 0.9051 - val_loss: 0.6128 - val_acc: 0.8600
Epoch 69/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4408 - acc: 0.9055 - val_loss: 0.6379 - val_acc: 0.8502
Epoch 70/128
1250/1250 [==============================] - 18s 14ms/step - loss: 0.4425 - acc: 0.9062 - val_loss: 0.6250 - val_acc: 0.8603
Epoch 71/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4409 - acc: 0.9071 - val_loss: 0.6666 - val_acc: 0.8415
Epoch 72/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4387 - acc: 0.9060 - val_loss: 0.6362 - val_acc: 0.8542
Epoch 73/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4457 - acc: 0.9045 - val_loss: 0.6029 - val_acc: 0.8632
Epoch 74/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4404 - acc: 0.9082 - val_loss: 0.7176 - val_acc: 0.8413
Epoch 75/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4390 - acc: 0.9068 - val_loss: 0.6483 - val_acc: 0.8511
Epoch 76/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4350 - acc: 0.9090 - val_loss: 0.7317 - val_acc: 0.8348
Epoch 77/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4319 - acc: 0.9106 - val_loss: 0.5889 - val_acc: 0.8710
Epoch 78/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4316 - acc: 0.9107 - val_loss: 0.6055 - val_acc: 0.8586
Epoch 79/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4385 - acc: 0.9079 - val_loss: 0.6882 - val_acc: 0.8481
Epoch 80/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4340 - acc: 0.9093 - val_loss: 0.7280 - val_acc: 0.8355
Epoch 81/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4347 - acc: 0.9099 - val_loss: 0.7610 - val_acc: 0.8295
Epoch 82/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4297 - acc: 0.9126 - val_loss: 0.6234 - val_acc: 0.8664
Epoch 83/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4335 - acc: 0.9102 - val_loss: 0.6613 - val_acc: 0.8464
Epoch 84/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4255 - acc: 0.9129 - val_loss: 0.6833 - val_acc: 0.8490
Epoch 85/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4272 - acc: 0.9118 - val_loss: 0.7257 - val_acc: 0.8315
Epoch 86/128
1250/1250 [==============================] - 18s 14ms/step - loss: 0.4282 - acc: 0.9118 - val_loss: 0.6606 - val_acc: 0.8518
Epoch 87/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4275 - acc: 0.9118 - val_loss: 0.6652 - val_acc: 0.8509
Epoch 88/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4256 - acc: 0.9130 - val_loss: 0.7058 - val_acc: 0.8334
Epoch 89/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4268 - acc: 0.9129 - val_loss: 0.6164 - val_acc: 0.8584
Epoch 90/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4285 - acc: 0.9126 - val_loss: 0.6870 - val_acc: 0.8475
Epoch 91/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4274 - acc: 0.9137 - val_loss: 0.6521 - val_acc: 0.8534
Epoch 92/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4252 - acc: 0.9139 - val_loss: 0.6770 - val_acc: 0.8433
Epoch 93/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4242 - acc: 0.9143 - val_loss: 0.5768 - val_acc: 0.8719
Epoch 94/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4225 - acc: 0.9132 - val_loss: 0.6560 - val_acc: 0.8572
Epoch 95/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4283 - acc: 0.9118 - val_loss: 0.6608 - val_acc: 0.8562
Epoch 96/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4216 - acc: 0.9158 - val_loss: 0.6533 - val_acc: 0.8539
Epoch 97/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4244 - acc: 0.9156 - val_loss: 0.6199 - val_acc: 0.8674
Epoch 98/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4187 - acc: 0.9155 - val_loss: 0.6434 - val_acc: 0.8586
Epoch 99/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4227 - acc: 0.9144 - val_loss: 0.5863 - val_acc: 0.8718
Epoch 100/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4217 - acc: 0.9148 - val_loss: 0.5987 - val_acc: 0.8688
Epoch 101/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4225 - acc: 0.9149 - val_loss: 0.6381 - val_acc: 0.8590
Epoch 102/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4223 - acc: 0.9161 - val_loss: 0.6461 - val_acc: 0.8590
Epoch 103/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4161 - acc: 0.9182 - val_loss: 0.6857 - val_acc: 0.8492
Epoch 104/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4180 - acc: 0.9173 - val_loss: 0.6148 - val_acc: 0.8648
Epoch 105/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4192 - acc: 0.9161 - val_loss: 0.6340 - val_acc: 0.8606
Epoch 106/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4215 - acc: 0.9137 - val_loss: 0.6015 - val_acc: 0.8692
Epoch 107/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4188 - acc: 0.9173 - val_loss: 0.5928 - val_acc: 0.8688
Epoch 108/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4207 - acc: 0.9151 - val_loss: 0.6245 - val_acc: 0.8605
Epoch 109/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4192 - acc: 0.9162 - val_loss: 0.6488 - val_acc: 0.8557
Epoch 110/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4205 - acc: 0.9175 - val_loss: 0.6039 - val_acc: 0.8650
Epoch 111/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4138 - acc: 0.9186 - val_loss: 0.8015 - val_acc: 0.8275
Epoch 112/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4215 - acc: 0.9176 - val_loss: 0.6478 - val_acc: 0.8568
Epoch 113/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4149 - acc: 0.9182 - val_loss: 0.5860 - val_acc: 0.8670
Epoch 114/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4173 - acc: 0.9190 - val_loss: 0.6282 - val_acc: 0.8657
Epoch 115/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4155 - acc: 0.9170 - val_loss: 0.6388 - val_acc: 0.8552
Epoch 116/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4188 - acc: 0.9178 - val_loss: 0.6022 - val_acc: 0.8669
Epoch 117/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4163 - acc: 0.9180 - val_loss: 0.6506 - val_acc: 0.8491
Epoch 118/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4185 - acc: 0.9184 - val_loss: 0.7026 - val_acc: 0.8471
Epoch 119/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4126 - acc: 0.9184 - val_loss: 0.6618 - val_acc: 0.8612
Epoch 120/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4185 - acc: 0.9183 - val_loss: 0.6187 - val_acc: 0.8652
Epoch 121/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4116 - acc: 0.9188 - val_loss: 0.6163 - val_acc: 0.8627
Epoch 122/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4092 - acc: 0.9190 - val_loss: 0.7231 - val_acc: 0.8351
Epoch 123/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4127 - acc: 0.9195 - val_loss: 0.6651 - val_acc: 0.8556
Epoch 124/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4106 - acc: 0.9201 - val_loss: 0.6494 - val_acc: 0.8566
Epoch 125/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4175 - acc: 0.9174 - val_loss: 0.7537 - val_acc: 0.8392
Epoch 126/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4125 - acc: 0.9201 - val_loss: 0.6802 - val_acc: 0.8500
Epoch 127/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4144 - acc: 0.9182 - val_loss: 0.6515 - val_acc: 0.8585
Epoch 128/128
1250/1250 [==============================] - 17s 14ms/step - loss: 0.4085 - acc: 0.9201 - val_loss: 0.6256 - val_acc: 0.8643
10000/10000 [==============================] - 1s 129us/step
Test loss: 0.6482033531188964
Test accuracy: 0.863
