{"config": [{"config": {"data_format": "channels_last", "name": "conv2d_1", "strides": [1, 1], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dtype": "float32", "bias_constraint": null, "use_bias": true, "trainable": true, "batch_input_shape": [null, 32, 32, 3], "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 32}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "elu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"gamma_constraint": null, "name": "batch_normalization_1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "scale": true, "beta_constraint": null, "center": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "strides": [1, 1], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 32}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "elu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"gamma_constraint": null, "name": "batch_normalization_2", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "scale": true, "beta_constraint": null, "center": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "seed": null, "name": "dropout_1", "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "strides": [1, 1], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 64}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "elu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"gamma_constraint": null, "name": "batch_normalization_3", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "scale": true, "beta_constraint": null, "center": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_4", "strides": [1, 1], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 64}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "elu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"gamma_constraint": null, "name": "batch_normalization_4", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "scale": true, "beta_constraint": null, "center": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "seed": null, "name": "dropout_2", "rate": 0.3, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_5", "strides": [1, 1], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 128}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "elu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"gamma_constraint": null, "name": "batch_normalization_5", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "scale": true, "beta_constraint": null, "center": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_6", "strides": [1, 1], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 128}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "elu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"gamma_constraint": null, "name": "batch_normalization_6", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "scale": true, "beta_constraint": null, "center": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "seed": null, "name": "dropout_3", "rate": 0.4, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"units": 10, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "activation": "softmax", "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow"}