{"class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "Conv2D", "config": {"activation": "elu", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_1", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "padding": "same", "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "elu", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_2", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "padding": "same", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null}}, {"class_name": "Conv2D", "config": {"activation": "elu", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_3", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "padding": "same", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "elu", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_4", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "padding": "same", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "trainable": true, "name": "dropout_2", "seed": null}}, {"class_name": "Conv2D", "config": {"activation": "elu", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_5", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "padding": "same", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "elu", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "name": "conv2d_6", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "padding": "same", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.4, "noise_shape": null, "trainable": true, "name": "dropout_3", "seed": null}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "name": "dense_1", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true}}], "backend": "tensorflow"}