{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "use_bias": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "name": "conv2d_1", "batch_input_shape": [null, 32, 32, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_1"}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_1", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "use_bias": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "strides": [1, 1], "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "name": "conv2d_2", "activity_regularizer": null, "filters": 32}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_2"}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_2", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_1", "noise_shape": null, "rate": 0.2}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "use_bias": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "strides": [1, 1], "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "name": "conv2d_3", "activity_regularizer": null, "filters": 64}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_3"}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_3", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "use_bias": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "strides": [1, 1], "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "name": "conv2d_4", "activity_regularizer": null, "filters": 64}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_4"}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_4", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_2", "noise_shape": null, "rate": 0.3}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "use_bias": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "strides": [1, 1], "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "name": "conv2d_5", "activity_regularizer": null, "filters": 128}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_5"}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_5", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "use_bias": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "strides": [1, 1], "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "name": "conv2d_6", "activity_regularizer": null, "filters": 128}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_6"}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_6", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_3", "noise_shape": null, "rate": 0.4}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "softmax", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_constraint": null, "units": 10}}]}